In [1]:
import pandas as pd

In [2]:
order = pd.read_csv("../../data/level2/m111-sku-order.csv", sep=',', parse_dates=['order_date'])

In [3]:
order.head()

  order_date       item_code  qty
0 2015-05-04  21073010000129  0.0
1 2015-05-04  21073010000078  0.0
2 2015-05-05  21074110000231  0.0
3 2015-05-05  21074110000018  0.0
4 2015-05-05  21074110000296  0.0

In [4]:
order.shape

(199040, 3)

In [6]:
order['month'] = order.order_date.astype('str').apply(lambda x: x[:7])

In [7]:
order.head()

  order_date       item_code  qty    month
0 2015-05-04  21073010000129  0.0  2015-05
1 2015-05-04  21073010000078  0.0  2015-05
2 2015-05-05  21074110000231  0.0  2015-05
3 2015-05-05  21074110000018  0.0  2015-05
4 2015-05-05  21074110000296  0.0  2015-05

In [8]:
order.drop(['order_date'], axis=1, inplace=True)

In [9]:
order.head()

        item_code  qty    month
0  21073010000129  0.0  2015-05
1  21073010000078  0.0  2015-05
2  21074110000231  0.0  2015-05
3  21074110000018  0.0  2015-05
4  21074110000296  0.0  2015-05